app/controllers/ledgers_controller.rb

SELECT "ledgers".* FROM "ledgers"
---
  def index
    @ledgers = Ledger.all

SELECT  "ledgers".* FROM "ledgers" WHERE "ledgers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ledger
      @ledger = Ledger.find(params[:id])